# Pandas
* Pandas is a popular open-source python libary used for data manupulation and analysis
* Two data structure, Series and DataFrame

In [1]:
import pandas as pd

## Pandas Series

In [2]:
# Creating a Series from a list
data = [10,20,40,30]
series = pd.Series(data)
print(series)
type(series)

0    10
1    20
2    40
3    30
dtype: int64

pandas.core.series.Series

In [3]:
 # Coustom Indexing in Series
custom_index = ['A','B','C','D']
series_with_curstom_index = pd.Series(data,index=custom_index)
print(series_with_curstom_index)

A    10
B    20
C    40
D    30
dtype: int64

In [4]:
print(series_with_curstom_index['A'])

10

# Pandas DataFrames

In [5]:
import pandas as pd

# Creating a DataFrame from a Dictionary
data = {
    "Name" : ["Bob","Hasan"], # column
    "Age" : [12,34],
    "City" : ["NY","UK"]
}
df = pd.DataFrame(data)
df

    Name  Age City
0    Bob   12   NY
1  Hasan   34   UK

In [6]:
# Apply custom index
custom_index = ['A','B']
data_frame_custom_index = pd.DataFrame(data,index=custom_index)
data_frame_custom_index

    Name  Age City
A    Bob   12   NY
B  Hasan   34   UK

## Data Selection and Indexing

### Column Selection

In [7]:
import pandas as pd

# Creating a DataFrame from a Dictionary
data = {
    "Name" : ["Bob","Hasan","Boss"], # column
    "Age" : [12,34,50],
    "City" : ["NY","UK","BD"]
}
df = pd.DataFrame(data)
df

    Name  Age City
0    Bob   12   NY
1  Hasan   34   UK
2   Boss   50   BD

In [8]:
# Selecting specific column by name
df[["Name","Age"]]

    Name  Age
0    Bob   12
1  Hasan   34
2   Boss   50

### Index location(iloc) and location(loc)

In [9]:
row_2 = df.iloc[2]
row_2

Name    Boss
Age       50
City      BD
Name: 2, dtype: object

In [10]:
# Selecting row using iloc[]
selected_rows = df.iloc[1:3] # (Integer-based indexing)
selected_rows

    Name  Age City
1  Hasan   34   UK
2   Boss   50   BD

In [11]:
# Selecting rows using loc[] (custom Label-based-indexing)
custom_index = ['A','B','C']
data_frame_custom_index = pd.DataFrame(data,index=custom_index)
data_frame_custom_index

    Name  Age City
A    Bob   12   NY
B  Hasan   34   UK
C   Boss   50   BD

In [12]:
data_frame_custom_index.loc["B":"C"]

    Name  Age City
B  Hasan   34   UK
C   Boss   50   BD

## Query()

In [13]:
import pandas as pd

# Creating a DataFrame from a Dictionary
data = {
    "Name" : ["Bob","Hasan","Boss"], # column
    "Age" : [12,34,50],
    "City" : ["NY","UK","BD"]
}
df = pd.DataFrame(data)
df

    Name  Age City
0    Bob   12   NY
1  Hasan   34   UK
2   Boss   50   BD

In [14]:
# Filtering rows using query expression
filtered = df.query("Age > 20")
filtered

    Name  Age City
1  Hasan   34   UK
2   Boss   50   BD

## Data Exploration and information

In [15]:
import pandas as pd

# Creating a DataFrame from a Dictionary
data = {
    "Name" : ["Bob","Hasan","Boss"], # column
    "Age" : [12,34,50],
    "City" : ["NY","UK","BD"]
}
df = pd.DataFrame(data)
df

    Name  Age City
0    Bob   12   NY
1  Hasan   34   UK
2   Boss   50   BD

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   City    3 non-null      object
dtypes: int64(1), object(2)
memory usage: 204.0+ bytes

## describe()

In [17]:
df.describe() # use only numarical values

             Age
count   3.000000
mean   32.000000
std    19.078784
min    12.000000
25%    23.000000
50%    34.000000
75%    42.000000
max    50.000000

## head() and tail()

In [18]:
import pandas as pd

# Creating a DataFrame from a Dictionary
data = {
    "Name" : ["Bob","Hasan","Boss","sakib",'sami','lop','crack','soup'], # column
    "Age" : [12,34,50,3,12,5,6,7],
    "City" : ["NY","UK","BD","NY","UK","BD","NY","UK"]
}
df = pd.DataFrame(data)
df

    Name  Age City
0    Bob   12   NY
1  Hasan   34   UK
2   Boss   50   BD
3  sakib    3   NY
4   sami   12   UK
5    lop    5   BD
6  crack    6   NY
7   soup    7   UK

In [19]:
df.head()

    Name  Age City
0    Bob   12   NY
1  Hasan   34   UK
2   Boss   50   BD
3  sakib    3   NY
4   sami   12   UK

In [20]:
df.head(6)

    Name  Age City
0    Bob   12   NY
1  Hasan   34   UK
2   Boss   50   BD
3  sakib    3   NY
4   sami   12   UK
5    lop    5   BD

In [21]:
df.tail()

    Name  Age City
3  sakib    3   NY
4   sami   12   UK
5    lop    5   BD
6  crack    6   NY
7   soup    7   UK

In [22]:
df.tail(3)

    Name  Age City
5    lop    5   BD
6  crack    6   NY
7   soup    7   UK

## value_counts()

In [23]:
df.value_counts()

Name   Age  City
Bob    12   NY      1
Boss   50   BD      1
Hasan  34   UK      1
crack  6    NY      1
lop    5    BD      1
sakib  3    NY      1
sami   12   UK      1
soup   7    UK      1
Name: count, dtype: int64

In [24]:
df["City"].value_counts()

City
NY    3
UK    3
BD    2
Name: count, dtype: int64

In [25]:
df["Age"].value_counts()

Age
12    2
34    1
50    1
3     1
5     1
6     1
7     1
Name: count, dtype: int64

## Data cleaning and Handling

### drop()

In [38]:
import pandas as pd

# Creating a sample dataframe
data = {
    'A' : [1,2,3],
    'B' : [4,5,6],
    'C' : [7,8,9]
}
df = pd.DataFrame(data)
df

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [27]:
# Dropping a column 'C' by specifying axis = 1
df_dropped_col = df.drop('C',axis=1)
df_dropped_col

   A  B
0  1  4
1  2  5
2  3  6

In [39]:
df

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [42]:
# inplace
df.drop('B',axis=1,inplace=True) # False means not deleting from main memory and true means deleting from main memeory

In [43]:
df

   A  C
0  1  7
1  2  8
2  3  9

In [44]:
# delete row
df.drop([0,1])

   A  C
2  3  9

### fillna()

In [46]:
df_with_null = pd.DataFrame({
    'A':[1,2,None,5],
    'B':[5,None,7,8]
})
df_with_null

     A    B
0  1.0  5.0
1  2.0  NaN
2  NaN  7.0
3  5.0  8.0

In [47]:
# Filling missing values with a specific value
df_filled = df_with_null.fillna(0)
df_filled

     A    B
0  1.0  5.0
1  2.0  0.0
2  0.0  7.0
3  5.0  8.0

### drop_duplicates()
* Revome row

In [48]:
data_duplicates = {
    'A':[1,2,1,2,3],
    'B':['x','y','x','y','z']
}
df = pd.DataFrame(data_duplicates)
df

   A  B
0  1  x
1  2  y
2  1  x
3  2  y
4  3  z

In [49]:
df.drop_duplicates(inplace=True)
df

   A  B
0  1  x
1  2  y
4  3  z

### replace()

In [55]:
data_duplicates = {
    'A':[1,2,3,4],
    'B':['x','y','z','x']
}
df = pd.DataFrame(data_duplicates)
df

   A  B
0  1  x
1  2  y
2  3  z
3  4  x

In [58]:
# Replace values
df.replace({'x':'NEWX',3:300},inplace=True)
df

     A     B
0    1  NEWX
1    2     y
2  300     z
3    4  NEWX

## Data Aggregation and Grouping

### groupby()

In [60]:
import pandas as pd

data = {
    'Cat' : ['A','B','A','B','A'],
    'Value': [10,20,15,25,30]
}
df = pd.DataFrame(data)
df

  Cat  Value
0   A     10
1   B     20
2   A     15
3   B     25
4   A     30

In [61]:
grouped = df.groupby('Cat')

In [63]:
for name,group in grouped:
    print(name)
    print(group)

A
  Cat  Value
0   A     10
2   A     15
4   A     30
B
  Cat  Value
1   B     20
3   B     25

### agg()

In [64]:
aggregated = grouped.agg({'Value':['sum','mean']})
aggregated

    Value
      sum       mean
Cat
A      55  18.333333
B      45  22.500000

## Data transformation

### pivot_table()

In [67]:
import pandas as pd
data = {
    'Data':['2022-01-01','2022-01-01','2022-01-02','2022-01-02'],
    'Name':['A','B','A','B'],
    'Price':[10,20,15,25]
}
df = pd.DataFrame(data)
df

         Data Name  Price
0  2022-01-01    A     10
1  2022-01-01    B     20
2  2022-01-02    A     15
3  2022-01-02    B     25

In [68]:
# Creating a pivot table to summarize data
pivot = df.pivot_table(values='Price',index = 'Data',columns='Name',aggfunc='sum')
pivot

Name         A   B
Data
2022-01-01  10  20
2022-01-02  15  25

### astype()

In [69]:
data = {
    'Num':[1,2,3]
}
df = pd.DataFrame(data)
df

   Num
0    1
1    2
2    3

In [70]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Num     3 non-null      int64
dtypes: int64(1)
memory usage: 156.0 bytes

In [71]:
# Convert int to string
df['Num'] = df['Num'].astype(str)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Num     3 non-null      object
dtypes: object(1)
memory usage: 156.0+ bytes

In [72]:
# Convert obj/str to num
df['Num'] = df['Num'].astype(float)
df.dtypes

Num    float64
dtype: object

## Read/Write CSV/Excel files

### Reading CSV File

In [2]:
import pandas as pd

df = pd.read_csv('healthcare-dataset-stroke-data.csv')
df

,id,gender,age,hypertension,heart_disease,ever_married,work_type,Residence_type,avg_glucose_level,bmi,smoking_status,stroke
0,9046,Male,67.0,0,1,Yes,Private,Urban,228.69,36.6,formerly smoked,1
1,51676,Female,61.0,0,0,Yes,Self-employed,Rural,202.21,NaN,never smoked,1
2,31112,Male,80.0,0,1,Yes,Private,Rural,105.92,32.5,never smoked,1
3,60182,Female,49.0,0,0,Yes,Private,Urban,171.23,34.4,smokes,1
4,1665,Female,79.0,1,0,Yes,Self-employed,Rural,174.12,24.0,never smoked,1
...,...,...,...,...,...,...,...,...,...,...,...,...
5105,18234,Female,80.0,1,0,Yes,Private,Urban,83.75,NaN,never smoked,0
5106,44873,Female,81.0,0,0,Yes,Self-employed,Urban,125.20,40.0,never smoked,0
5107,19723,Female,35.0,0,0,Yes,Self-employed,Rural,82.99,30.6,never smoked,0
5108,37544,Male,51.0,0,0,Yes,Private,Rural,166.29,25.6,formerly smoked,0
5109,44679,Female,44.0,0,0,Yes,Govt_job,Urban,85.28,26.2,Unknown,0

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5110 entries, 0 to 5109
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 5110 non-null   int64
 1   gender             5110 non-null   object
 2   age                5110 non-null   float64
 3   hypertension       5110 non-null   int64
 4   heart_disease      5110 non-null   int64
 5   ever_married       5110 non-null   object
 6   work_type          5110 non-null   object
 7   Residence_type     5110 non-null   object
 8   avg_glucose_level  5110 non-null   float64
 9   bmi                4909 non-null   float64
 10  smoking_status     5110 non-null   object
 11  stroke             5110 non-null   int64
dtypes: float64(3), int64(4), object(5)
memory usage: 479.2+ KB

In [4]:
df.head()

,id,gender,age,hypertension,heart_disease,ever_married,work_type,Residence_type,avg_glucose_level,bmi,smoking_status,stroke
0,9046,Male,67.0,0,1,Yes,Private,Urban,228.69,36.6,formerly smoked,1
1,51676,Female,61.0,0,0,Yes,Self-employed,Rural,202.21,NaN,never smoked,1
2,31112,Male,80.0,0,1,Yes,Private,Rural,105.92,32.5,never smoked,1
3,60182,Female,49.0,0,0,Yes,Private,Urban,171.23,34.4,smokes,1
4,1665,Female,79.0,1,0,Yes,Self-employed,Rural,174.12,24.0,never smoked,1

## Writing CSV

In [5]:
import pandas as pd

# Creating a DataFrame from a Dictionary
data = {
    "Name" : ["Bob","Hasan","Boss","sakib",'sami','lop','crack','soup'], # column
    "Age" : [12,34,50,3,12,5,6,7],
    "City" : ["NY","UK","BD","NY","UK","BD","NY","UK"]
}
df = pd.DataFrame(data)
df

    Name  Age City
0    Bob   12   NY
1  Hasan   34   UK
2   Boss   50   BD
3  sakib    3   NY
4   sami   12   UK
5    lop    5   BD
6  crack    6   NY
7   soup    7   UK

In [6]:
# Writing the df to a csv file
df.to_csv('output.csv',index=False)

## Reading Excel File

In [10]:
# Reading a excel file into df
df = pd.read_excel('students.xlsx',sheet_name='Sheet1')
df.info()
df

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Id      3 non-null      int64
 1   name    3 non-null      object
 2   dept    3 non-null      object
 3   cgpa    3 non-null      float64
dtypes: float64(1), int64(1), object(2)
memory usage: 228.0+ bytes

    Id        name dept  cgpa
0  111     Jon Doe  ECE  3.90
1  121    Jon Snow  BBA  3.33
2  232  Alice Cuba  ECO  3.55

In [11]:
df.head()

    Id        name dept  cgpa
0  111     Jon Doe  ECE  3.90
1  121    Jon Snow  BBA  3.33
2  232  Alice Cuba  ECO  3.55

## Writing Excel File

In [12]:
import pandas as pd

# Creating a DataFrame from a Dictionary
data = {
    "Name" : ["Bob","Hasan","Boss","sakib",'sami','lop','crack','soup'], # column
    "Age" : [12,34,50,3,12,5,6,7],
    "City" : ["NY","UK","BD","NY","UK","BD","NY","UK"]
}
df = pd.DataFrame(data)
df

    Name  Age City
0    Bob   12   NY
1  Hasan   34   UK
2   Boss   50   BD
3  sakib    3   NY
4   sami   12   UK
5    lop    5   BD
6  crack    6   NY
7   soup    7   UK

In [13]:
df.to_excel('output.xlsx',sheet_name='Sheet1')